# -*- coding: utf-8 -*-
#Задача 2
a = int(input('Введите длину первого катета: '))
b = int(input('Введиите длину второго катета: '))
print(1/2 * a * b)