# -*- coding: utf-8 -*-
#Задача 4
second = int(input('Введите количество секунд '))
mins = second/60
hour = mins/60
day = hour/24
print ('Дни:',day, 'Часы:',hour, 'Минуты:',mins, 'Секунды:',second)