# -*- coding: utf-8 -*-
#Задача 4
N = int(input('Введите кол-во чисел '))
s = 0
for i in range(N):
    s += int(input())
print(s)